Tekla.Structures.Dialog.UIControls.WpfReinforcementCatalog
The WpfReinforcementCatalog class represents a group of controls to select rebars
using the reinforcement catalog.
WpfReinforcementCatalog

Tekla.Structures.Dialog.UIControls.WpfReinforcementCatalog.#ctor
Initiates a new instance of the control.

Tekla.Structures.Dialog.UIControls.WpfReinforcementCatalog.#ctor(System.String,System.String,System.Double)
Creates a new instance of the ReinforcementCatalog and will select in the tree
the rebar that contains the given parameters (if possible).
Size: The size of the rebar to be selected.
Grade: The grade of the rebar to be selected.
BendRadius: The bend radius of the rebar to be selected.

Tekla.Structures.Dialog.UIControls.WpfReinforcementCatalog._RebarSelectionForm
New instance of the reinforcement selection dialog

Tekla.Structures.Dialog.UIControls.WpfReinforcementCatalog.OnValueChanged(System.Object)
Event handler for passing generic catalog data back to dialog
data: value data

Tekla.Structures.Dialog.UIControls.WpfReinforcementCatalog.button_Loaded(System.Object,System.Windows.RoutedEventArgs)
When the load event is raised, the control begins to enumerate through the shape
catalog.
sender: The event sender.
e: The event arguments.

Tekla.Structures.Dialog.UIControls.WpfReinforcementCatalog.button_Click(System.Object,System.Windows.RoutedEventArgs)
Opens the mesh catalog dialog for selecting a mesh
sender: The event sender.
e: The event arguments.

Tekla.Structures.Dialog.UIControls.WpfReinforcementCatalog.SelectedRebarSize
Gets the selected rebar size in the control.

Tekla.Structures.Dialog.UIControls.WpfReinforcementCatalog.SelectedRebarGrade
Gets the selected rebar grade in the control.

Tekla.Structures.Dialog.UIControls.WpfReinforcementCatalog.SelectedRebarBendingRadius
Gets the selected rebar bending radius in the control.

Tekla.Structures.Dialog.UIControls.WpfReinforcementCatalog.SelectedUsage
Gets the selected rebar usage in the control.

Tekla.Structures.Dialog.UIControls.WpfReinforcementCatalog.ButtonWidth
Gets and sets the width of the button control.

Tekla.Structures.Dialog.UIControls.WpfReinforcementCatalog.ButtonHeight
Gets and sets the height of the button control.

Tekla.Structures.Dialog.UIControls.WpfReinforcementCatalog.ButtonText
Gets and sets the text of the button control.

Tekla.Structures.Dialog.UIControls.WpfReinforcementCatalog.RebarSelectionForm
New instance of the reinforcement selection dialog

Tekla.Structures.Dialog.UIControls.WpfReinforcementCatalog.SelectClicked
The SelectClicked event is raised when the Select button is clicked.

Tekla.Structures.Dialog.UIControls.WpfReinforcementCatalog.SelectionDone
The SelectionDone event is raised when the selection has been done.
Remarks:
Please note that when filling in controls programmatically, the bound attribute is not stored automatically.
The attribute has to be set using the Tekla.Structures.Dialog.FormBase.SetAttributeValue(System.Windows.Forms.Control,System.Object) method of
the Tekla.Structures.Dialog.FormBase class.

Tekla.Structures.Dialog.UIControls.WpfReinforcementCatalog.InitializeComponent
InitializeComponent